Revit 2026 API

# FabricationNetworkChangeService Properties

---

The FabricationNetworkChangeService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace